newbiemacs/newbiemacs-installation.org
#+title: Newbiemacs Installation
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Install Newbiemacs on Mac
1. Download Emacs and install it. [[https://emacsformacosx.com/][Click here]]
2. Install Git if it's not installed. [[https://git-scm.com/book/en/v2/Getting-Started-Installing-Git][Click here]]
3. Open a terminal and enter the following lines. (You can open a
   terminal by pressing Command+Space and typing "terminal". You can
   just copy the whole thing by clicking the icon on the top-right
   corner of the box below and then paste it in your terminal.)
   : cd ~
   : git clone https://github.com/jangsookim/newbiemacs.git
   : mv newbiemacs nbm-root
   : cp ~/nbm-root/.emacs ~/.emacs
   :
4. Run Emacs. It will take several minutes to download necessary
   packages. There may be some warnings but it's okay.
5. Close Emacs and run it again. The above Newbiemacs main screeen will be shown.
** Additional steps for latex on Mac (optional)
If you want to edit tex files in Newbiemacs, you need to do the following (only once).
1. Install Skim. [[https://skim-app.sourceforge.io/][Click here]]
2. Install MacTeX (this is TeX Live for Mac) if it's not installed. [[https://www.tug.org/mactex/][Click here]]
3. Open Skim and press ~CMD+,~ (Hold the command key and press the comma key.)
4. Go to the ~Sync~ menu and check the two check boxes.
5. Select Emacs in the drop-down box for ~Preset~.
* Install Newbiemacs on Windows
1. Download Emacs and install it. [[http://ftp.jaist.ac.jp/pub/GNU/emacs/windows/emacs-28/][Click here]] and download "emacs-28.2-installer.exe".
2. Install Git if it's not installed. [[https://git-scm.com/download/win][Click here]] (Download "Standalone Installer".)
3. Open "Command Prompt" (not "terminal" or "PowerShell") and enter the following
   lines. (You can just copy the whole thing by clicking the icon on
   the top-right corner of the box below and then paste it in your
   command prompt.)
   : cd %userprofile%
   : git clone https://github.com/jangsookim/newbiemacs.git
   : rename newbiemacs nbm-root
   : copy %userprofile%\nbm-root\.emacs-windows %userprofile%\AppData\Roaming\.emacs
   :
4. Run Emacs. It will take several minutes to download necessary packages. There
   may be some warnings but it's okay.
5. Close Emacs and run it again. The above Newbiemacs main screeen will be shown.
** Additional steps for org-roam on Windows (optional)
If you want to use org-roam, you need to do the following (only once). 
1. Install Perl if it's not installed. [[https://strawberryperl.com/][Click here]]
2. Install [[https://www.google.com/chrome/][Google Chrome]] if it's not installed. (Needed to view node connections.)
3. Run Emacs and type the following. (SPC means the space key and RET
   means the return key, i.e., the enter key. There may be some warnings but it's okay.)
   : SPC SPC package-refresh-contents RET
   : SPC SPC package-install RET org-roam RET
   : SPC SPC package-install RET org-roam-ui RET
4. Restart Emacs. (It will take some time to compile EmacSQL SQLite binary.)
** Additional steps for latex on Windows (optional)
If you want to use latex, you need to do the following (only once). 
1. Install Perl if it's not installed. [[https://strawberryperl.com/][Click here]]
2. Install TeX Live if it's not installed. [[https://www.tug.org/texlive/windows.html][Click here]] (It may take about 2 hours.)
3. Install Sumatra PDF. [[https://www.sumatrapdfreader.org/free-pdf-reader][Click here]] (Download "Installer", not "Portable version".)
4. Open Sumatra PDF and in the menu go to ~Settings~ and click ~Options...~.
5. Enter the following line in the box below ~Set inverse search command-line~.
   : C:\Program Files\Emacs\emacs-28.2\bin\emacsclientw.exe -n +%l "%f"
   If the box is not visible, then in the menu go to ~Settings~ and click ~Advanced Options...~.
   It will open a text file. Enter the following line anywhere there and save the file.
   : InverseSearchCmdLine = C:\Program Files\Emacs\emacs-28.2\bin\emacsclientw.exe -n +%l "%f"
